In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv(r"C:\Users\99jib\OneDrive\Desktop\Python  Practice\mckinsey.csv")

In [12]:
df

          country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [3]:
df.head()

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [4]:
df.tail()

       country  year  population continent  life_exp     gdp_cap
1699  Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700  Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703  Zimbabwe  2007    12311143    Africa    43.487  469.709298

In [15]:
df.shape

(1704, 6)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     1704 non-null   object
 1   year        1704 non-null   int64
 2   population  1704 non-null   int64
 3   continent   1704 non-null   object
 4   life_exp    1704 non-null   float64
 5   gdp_cap     1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [18]:
df.columns

Index(['country', 'year', 'population', 'continent', 'life_exp', 'gdp_cap'], dtype='object')

In [19]:
df.keys

<bound method NDFrame.keys of           country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]>

In [6]:
df.index.values

array([   0,    1,    2, ..., 1701, 1702, 1703], shape=(1704,))

In [7]:
df.index= list(range(1,df.shape[0]+1))    # indexing start from 1
df

          country  year  population continent  life_exp     gdp_cap
1     Afghanistan  1952     8425333      Asia    28.801  779.445314
2     Afghanistan  1957     9240934      Asia    30.332  820.853030
3     Afghanistan  1962    10267083      Asia    31.997  853.100710
4     Afghanistan  1967    11537966      Asia    34.020  836.197138
5     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1700     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1701     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1702     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1703     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1704     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [10]:
df.index= np.arange (1,df.shape[0]+1,dtype= 'float')
df

            country  year  population continent  life_exp     gdp_cap
1.0     Afghanistan  1952     8425333      Asia    28.801  779.445314
2.0     Afghanistan  1957     9240934      Asia    30.332  820.853030
3.0     Afghanistan  1962    10267083      Asia    31.997  853.100710
4.0     Afghanistan  1967    11537966      Asia    34.020  836.197138
5.0     Afghanistan  1972    13079460      Asia    36.088  739.981106
...             ...   ...         ...       ...       ...         ...
1700.0     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1701.0     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1702.0     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1703.0     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1704.0     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [14]:
new_index= df.head()
new_index

         country  year  population continent  life_exp     gdp_cap
1.0  Afghanistan  1952     8425333      Asia    28.801  779.445314
2.0  Afghanistan  1957     9240934      Asia    30.332  820.853030
3.0  Afghanistan  1962    10267083      Asia    31.997  853.100710
4.0  Afghanistan  1967    11537966      Asia    34.020  836.197138
5.0  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [16]:
new_index.index= ['a','b','c','d','e']
new_index

       country  year  population continent  life_exp     gdp_cap
a  Afghanistan  1952     8425333      Asia    28.801  779.445314
b  Afghanistan  1957     9240934      Asia    30.332  820.853030
c  Afghanistan  1962    10267083      Asia    31.997  853.100710
d  Afghanistan  1967    11537966      Asia    34.020  836.197138
e  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [20]:
df.index = np.arange (1,df.shape[0]+1 , dtype = 'int')
df

          country  year  population continent  life_exp     gdp_cap
1     Afghanistan  1952     8425333      Asia    28.801  779.445314
2     Afghanistan  1957     9240934      Asia    30.332  820.853030
3     Afghanistan  1962    10267083      Asia    31.997  853.100710
4     Afghanistan  1967    11537966      Asia    34.020  836.197138
5     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1700     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1701     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1702     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1703     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1704     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [23]:
ser = df["country"] 
ser.head(20)

1     Afghanistan
2     Afghanistan
3     Afghanistan
4     Afghanistan
5     Afghanistan
6     Afghanistan
7     Afghanistan
8     Afghanistan
9     Afghanistan
10    Afghanistan
11    Afghanistan
12    Afghanistan
13        Albania
14        Albania
15        Albania
16        Albania
17        Albania
18        Albania
19        Albania
20        Albania
Name: country, dtype: object

ser=[12]

In [25]:
ser [5:15]  #  python slicing

6     Afghanistan
7     Afghanistan
8     Afghanistan
9     Afghanistan
10    Afghanistan
11    Afghanistan
12    Afghanistan
13        Albania
14        Albania
15        Albania
Name: country, dtype: object

In [26]:
df.loc[1]

country       Afghanistan
year                 1952
population        8425333
continent            Asia
life_exp           28.801
gdp_cap        779.445314
Name: 1, dtype: object

In [27]:
df.loc[1:3]

       country  year  population continent  life_exp     gdp_cap
1  Afghanistan  1952     8425333      Asia    28.801  779.445314
2  Afghanistan  1957     9240934      Asia    30.332  820.853030
3  Afghanistan  1962    10267083      Asia    31.997  853.100710

In [28]:
df.iloc[1]

country       Afghanistan
year                 1957
population        9240934
continent            Asia
life_exp           30.332
gdp_cap         820.85303
Name: 2, dtype: object

In [29]:
df.iloc[0:2]

       country  year  population continent  life_exp     gdp_cap
1  Afghanistan  1952     8425333      Asia    28.801  779.445314
2  Afghanistan  1957     9240934      Asia    30.332  820.853030

In [5]:
df.iloc[[1,11,22]]

        country  year  population continent  life_exp      gdp_cap
1   Afghanistan  1957     9240934      Asia    30.332   820.853030
11  Afghanistan  2007    31889923      Asia    43.828   974.580338
22      Albania  2002     3508512    Europe    75.651  4604.211737

In [7]:
df.iloc[-1]      # Works and gives last row in dataframe

country         Zimbabwe
year                2007
population      12311143
continent         Africa
life_exp          43.487
gdp_cap       469.709298
Name: 1703, dtype: object

In [12]:
temp = df.set_index("country")
temp

             year  population continent  life_exp     gdp_cap
country
Afghanistan  1952     8425333      Asia    28.801  779.445314
Afghanistan  1957     9240934      Asia    30.332  820.853030
Afghanistan  1962    10267083      Asia    31.997  853.100710
Afghanistan  1967    11537966      Asia    34.020  836.197138
Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...         ...       ...       ...         ...
Zimbabwe     1987     9216418    Africa    62.351  706.157306
Zimbabwe     1992    10704340    Africa    60.377  693.420786
Zimbabwe     1997    11404948    Africa    46.809  792.449960
Zimbabwe     2002    11926563    Africa    39.989  672.038623
Zimbabwe     2007    12311143    Africa    43.487  469.709298

[1704 rows x 5 columns]

In [13]:
temp.loc['Afghanistan']

             year  population continent  life_exp     gdp_cap
country
Afghanistan  1952     8425333      Asia    28.801  779.445314
Afghanistan  1957     9240934      Asia    30.332  820.853030
Afghanistan  1962    10267083      Asia    31.997  853.100710
Afghanistan  1967    11537966      Asia    34.020  836.197138
Afghanistan  1972    13079460      Asia    36.088  739.981106
Afghanistan  1977    14880372      Asia    38.438  786.113360
Afghanistan  1982    12881816      Asia    39.854  978.011439
Afghanistan  1987    13867957      Asia    40.822  852.395945
Afghanistan  1992    16317921      Asia    41.674  649.341395
Afghanistan  1997    22227415      Asia    41.763  635.341351
Afghanistan  2002    25268405      Asia    42.129  726.734055
Afghanistan  2007    31889923      Asia    43.828  974.580338

In [3]:
df.reset_index()

      index      country  year  population continent  life_exp     gdp_cap
0         0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1         1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2         2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3         3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4         4  Afghanistan  1972    13079460      Asia    36.088  739.981106
...     ...          ...   ...         ...       ...       ...         ...
1699   1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700   1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701   1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702   1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703   1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 7 columns]

In [4]:
 df.reset_index(drop=True)  # By using drop=True we can prevent creation of a new column

          country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [5]:
 df.reset_index(drop=True, inplace=True)

In [3]:
df.loc[4]

country       Afghanistan
year                 1972
population       13079460
continent            Asia
life_exp           36.088
gdp_cap        739.981106
Name: 4, dtype: object

In [4]:
df.head()

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [6]:
le = df['life_exp']
le

0       28.801
1       30.332
2       31.997
3       34.020
4       36.088
         ...
1699    62.351
1700    60.377
1701    46.809
1702    39.989
1703    43.487
Name: life_exp, Length: 1704, dtype: float64

In [7]:
le.mean()

np.float64(59.474439366197174)

In [8]:
le.sum()

np.float64(101344.44467999999)

In [9]:
le.count()

np.int64(1704)

In [10]:
le.min()

np.float64(23.599)

In [11]:
le.max()

np.float64(82.603)

In [12]:
le.sum() / le.count()

np.float64(59.474439366197174)

# Python Practice

In [1]:
import pandas as pd
import numpy as np

In [5]:
df=pd.read_csv(r"D:\Marerials for Study\Python pandas\Python Prc Data\pandas_practice_dataset.csv")
df

,order_id,customer_id,region,product_category,sales,cost,discount,order_date,revenue,profit
0,1001,39,North,Electronics,3218,1996,10.0,2024-01-01,3109,1113
1,1002,29,North,Grocery,2241,2599,15.0,2024-01-02,2164,-435
2,1003,15,West,Electronics,3159,1274,NaN,2024-01-03,3017,1743
3,1004,43,South,Grocery,4648,978,5.0,2024-01-04,4519,3541
4,1005,8,South,Furniture,3059,2086,5.0,2024-01-05,3013,927
...,...,...,...,...,...,...,...,...,...,...
195,1196,37,East,Clothing,639,932,0.0,2024-07-14,621,-311
196,1197,33,South,Electronics,2879,1080,0.0,2024-07-15,2830,1750
197,1198,42,North,Electronics,4236,1076,15.0,2024-07-16,4202,3126
198,1199,44,South,Clothing,4935,1696,10.0,2024-07-17,4823,3127
199,1200,24,East,Grocery,3875,968,15.0,2024-07-18,3844,2876

In [6]:
df.head(10)     #Display first 10 rows of the dataset.

,order_id,customer_id,region,product_category,sales,cost,discount,order_date,revenue,profit
0,1001,39,North,Electronics,3218,1996,10.0,2024-01-01,3109,1113
1,1002,29,North,Grocery,2241,2599,15.0,2024-01-02,2164,-435
2,1003,15,West,Electronics,3159,1274,NaN,2024-01-03,3017,1743
3,1004,43,South,Grocery,4648,978,5.0,2024-01-04,4519,3541
4,1005,8,South,Furniture,3059,2086,5.0,2024-01-05,3013,927
5,1006,21,South,Grocery,2365,2558,10.0,2024-01-06,2284,-274
6,1007,39,East,Furniture,2579,2829,10.0,2024-01-07,2443,-386
7,1008,19,South,Grocery,4746,2849,0.0,2024-01-08,4631,1782
8,1009,23,East,Electronics,1735,974,NaN,2024-01-09,1634,660
9,1010,11,West,Grocery,1857,1631,15.0,2024-01-10,1817,186

In [7]:
df.tail()  #Display last 5 rows.

,order_id,customer_id,region,product_category,sales,cost,discount,order_date,revenue,profit
195,1196,37,East,Clothing,639,932,0.0,2024-07-14,621,-311
196,1197,33,South,Electronics,2879,1080,0.0,2024-07-15,2830,1750
197,1198,42,North,Electronics,4236,1076,15.0,2024-07-16,4202,3126
198,1199,44,South,Clothing,4935,1696,10.0,2024-07-17,4823,3127
199,1200,24,East,Grocery,3875,968,15.0,2024-07-18,3844,2876

In [14]:
 df.columns     #Show column names of the dataset.

Index(['order_id', 'customer_id', 'region', 'product_category', 'sales',
       'cost', 'discount', 'order_date', 'revenue', 'profit'],
      dtype='object')

In [15]:
 df.info()     #Check data types of each column.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          200 non-null    int64
 1   customer_id       200 non-null    int64
 2   region            200 non-null    object
 3   product_category  200 non-null    object
 4   sales             200 non-null    int64
 5   cost              200 non-null    int64
 6   discount          160 non-null    float64
 7   order_date        200 non-null    object
 8   revenue           200 non-null    int64
 9   profit            200 non-null    int64
dtypes: float64(1), int64(6), object(3)
memory usage: 15.8+ KB

In [16]:
df.isna().sum()

order_id             0
customer_id          0
region               0
product_category     0
sales                0
cost                 0
discount            40
order_date           0
revenue              0
profit               0
dtype: int64

In [19]:
  df["sales"]   #Select only the column sales

0      3218
1      2241
2      3159
3      4648
4      3059
       ...
195     639
196    2879
197    4236
198    4935
199    3875
Name: sales, Length: 200, dtype: int64

In [24]:
df[["customer_id","region"]]    #Select columns customer_id and region.

     customer_id region
0             39  North
1             29  North
2             15   West
3             43  South
4              8  South
..           ...    ...
195           37   East
196           33  South
197           42  North
198           44  South
199           24   East

[200 rows x 2 columns]

In [27]:
df[df['sales']>500 ]     #Filter rows where sales > 500.

,order_id,customer_id,region,product_category,sales,cost,discount,order_date,revenue,profit
0,1001,39,North,Electronics,3218,1996,10.0,2024-01-01,3109,1113
1,1002,29,North,Grocery,2241,2599,15.0,2024-01-02,2164,-435
2,1003,15,West,Electronics,3159,1274,NaN,2024-01-03,3017,1743
3,1004,43,South,Grocery,4648,978,5.0,2024-01-04,4519,3541
4,1005,8,South,Furniture,3059,2086,5.0,2024-01-05,3013,927
...,...,...,...,...,...,...,...,...,...,...
195,1196,37,East,Clothing,639,932,0.0,2024-07-14,621,-311
196,1197,33,South,Electronics,2879,1080,0.0,2024-07-15,2830,1750
197,1198,42,North,Electronics,4236,1076,15.0,2024-07-16,4202,3126
198,1199,44,South,Clothing,4935,1696,10.0,2024-07-17,4823,3127
199,1200,24,East,Grocery,3875,968,15.0,2024-07-18,3844,2876

In [26]:
df.describe()  # to see all data

,order_id,customer_id,sales,cost,discount,revenue,profit
count,200.000000,200.000000,200.000000,200.000000,160.00000,200.000000,200.000000
mean,1100.500000,25.260000,2619.715000,1515.310000,7.65625,2513.515000,998.205000
std,57.879185,14.229716,1309.441802,906.735446,5.63351,1313.171404,1617.592082
min,1001.000000,1.000000,214.000000,59.000000,0.00000,77.000000,-2718.000000
25%,1050.750000,13.000000,1451.750000,719.750000,3.75000,1341.250000,-255.500000
50%,1100.500000,26.000000,2859.500000,1514.500000,10.00000,2741.500000,913.000000
75%,1150.250000,38.250000,3653.750000,2217.000000,15.00000,3574.000000,2329.000000
max,1200.000000,50.000000,4949.000000,2997.000000,15.00000,4823.000000,4144.000000

In [33]:
df['profit'] = df['revenue'] - df['cost']  
df                                            #Add a new column profit = revenue - cost.

,order_id,customer_id,region,product_category,sales,cost,discount,order_date,revenue,profit
0,1001,39,North,Electronics,3218,1996,10.0,2024-01-01,3109,1113
1,1002,29,North,Grocery,2241,2599,15.0,2024-01-02,2164,-435
2,1003,15,West,Electronics,3159,1274,NaN,2024-01-03,3017,1743
3,1004,43,South,Grocery,4648,978,5.0,2024-01-04,4519,3541
4,1005,8,South,Furniture,3059,2086,5.0,2024-01-05,3013,927
...,...,...,...,...,...,...,...,...,...,...
195,1196,37,East,Clothing,639,932,0.0,2024-07-14,621,-311
196,1197,33,South,Electronics,2879,1080,0.0,2024-07-15,2830,1750
197,1198,42,North,Electronics,4236,1076,15.0,2024-07-16,4202,3126
198,1199,44,South,Clothing,4935,1696,10.0,2024-07-17,4823,3127
199,1200,24,East,Grocery,3875,968,15.0,2024-07-18,3844,2876

In [10]:
 df.rename(columns={'cust_id': 'customer_id'} )     #Rename column cust_id to customer_id.

,order_id,customer_id,region,product_category,sales,cost,discount,order_date,revenue,profit
0,1001,39,North,Electronics,3218,1996,10.0,2024-01-01,3109,1113
1,1002,29,North,Grocery,2241,2599,15.0,2024-01-02,2164,-435
2,1003,15,West,Electronics,3159,1274,NaN,2024-01-03,3017,1743
3,1004,43,South,Grocery,4648,978,5.0,2024-01-04,4519,3541
4,1005,8,South,Furniture,3059,2086,5.0,2024-01-05,3013,927
...,...,...,...,...,...,...,...,...,...,...
195,1196,37,East,Clothing,639,932,0.0,2024-07-14,621,-311
196,1197,33,South,Electronics,2879,1080,0.0,2024-07-15,2830,1750
197,1198,42,North,Electronics,4236,1076,15.0,2024-07-16,4202,3126
198,1199,44,South,Clothing,4935,1696,10.0,2024-07-17,4823,3127
199,1200,24,East,Grocery,3875,968,15.0,2024-07-18,3844,2876

In [6]:
 df.drop(columns=['temp_flag'], inplace=True)      #Drop column temp_flag

KeyError: "['temp_flag'] not found in axis"

In [15]:
df.sort_values(by='sales', ascending=False, inplace=True) #Sort dataset by sales descending

In [16]:
df['sales'].count()    #Count number of non-null values in column sales.

np.int64(200)

In [17]:
df['region'].unique()

array(['North', 'West', 'South', 'East'], dtype=object)

In [21]:
 df['order_date'] = pd.to_datetime(df['order_date']) #Convert column order_date to datetime.

In [10]:
df.groupby('region')['sales'].mean()   # Find mean sales by each region.

region
East     2588.600000
North    2804.652174
South    2435.984615
West     2729.613636
Name: sales, dtype: float64

In [12]:
 df.groupby('product_category') ['revenue'].sum()   #Find total revenue by product_category.

product_category
Clothing       126479
Electronics    138591
Furniture       91023
Grocery        146610
Name: revenue, dtype: int64

In [15]:
df.groupby('customer_id')['order_id'].count()    #Find number of orders per customer.

customer_id
1      5
2      5
3      4
4      4
5      2
6      3
7      5
8      7
9      6
10     1
11     4
12     2
13     3
14     6
15     7
16     2
17     2
18     3
19     1
20     2
21     4
22     4
23     4
24     8
25     5
26     5
27     5
28     7
29     4
30     3
31     1
32     3
33     5
34     2
35     6
36     4
37     5
38     1
39     9
40     4
41     3
42     6
43     2
44    10
45     5
47     5
48     2
49     2
50     2
Name: order_id, dtype: int64

In [25]:
df['profit']=df['profit'].clip(lower=0)  
df                                         #Replace all negative profit values with 0.

,order_id,customer_id,region,product_category,sales,cost,discount,order_date,revenue,profit
0,1001,39,North,Electronics,3218,1996,10.0,2024-01-01,3109,1113
1,1002,29,North,Grocery,2241,2599,15.0,2024-01-02,2164,0
2,1003,15,West,Electronics,3159,1274,NaN,2024-01-03,3017,1743
3,1004,43,South,Grocery,4648,978,5.0,2024-01-04,4519,3541
4,1005,8,South,Furniture,3059,2086,5.0,2024-01-05,3013,927
...,...,...,...,...,...,...,...,...,...,...
195,1196,37,East,Clothing,639,932,0.0,2024-07-14,621,0
196,1197,33,South,Electronics,2879,1080,0.0,2024-07-15,2830,1750
197,1198,42,North,Electronics,4236,1076,15.0,2024-07-16,4202,3126
198,1199,44,South,Clothing,4935,1696,10.0,2024-07-17,4823,3127
199,1200,24,East,Grocery,3875,968,15.0,2024-07-18,3844,2876